TexasInstruments/f29h85x-sdk/source/driverlib/dlt.h
//*****************************************************************************
//
//! Disable Interrupt.
//!
//! \param events can be a bitwise OR of the following events:
//!      - DLT_INT_TIMER1_OVF
//!      - DLT_INT_TIMER2_OVF
//!      - DLT_INT_FIFO_OVF
//!      - DLT_INT_FIFO_UF
//!      - DLT_INT_FIFO_TRIG
//!
//! The corresponding events are disabled to generate an interrupt.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DLT_disableInterrupt(uint16_t events)
{
    HWREGH(CPUDLT_BASE + DLT_O_INT_EN) &= ~(uint16_t)events;
}

//*****************************************************************************
//
//! Force event.
//!
//! \param events can be a bitwise OR of the following events:
//!      - DLT_INT_TIMER1_OVF
//!      - DLT_INT_TIMER2_OVF
//!      - DLT_INT_FIFO_OVF
//!      - DLT_INT_FIFO_UF
//!      - DLT_INT_FIFO_TRIG
//!
//! This function forces the corresponding events.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DLT_forceEvent(uint16_t events)
{
    HWREGH(CPUDLT_BASE + DLT_O_INT_FRC) = (uint16_t)events;
}

//*****************************************************************************
//
//! Clear Event.
//!
//! \param events can be a bitwise OR of the following events:
//!      - DLT_INT_INT
//!      - DLT_INT_TIMER1_OVF
//!      - DLT_INT_TIMER2_OVF
//!      - DLT_INT_FIFO_OVF
//!      - DLT_INT_FIFO_UF
//!      - DLT_INT_FIFO_TRIG
//!
//! This function clears the corresponding events.
//! Clearing the INT flag will enable further interrupts to be generated if
//! any of the event flags are set to 1.
//!
//! \return None.
//
//*****************************************************************************
static inline void
DLT_clearEvent(uint16_t events)
{
    HWREGH(CPUDLT_BASE + DLT_O_INT_CLR) = (uint16_t)events;
}

//*****************************************************************************
//
//! Configure Tag Filtering.
//!
//! \param *configParams configuration parameter
//!                      Refer struct DLT_ConfigTagFilterParams
//!
//! This function configures Tag filtering.
//! Recording in FIFO is started if incoming TAG when masked with startMask
//! matches the startReference.
//! Recording in FIFO is stopped if incoming TAG when masked with endMask
//! matches the endReference.
//!
//! \return None.
//
//*****************************************************************************
extern void
DLT_configTagFilter(const DLT_ConfigTagFilterParams *configParams);

//*****************************************************************************
//
//! Configure ERAD Filtering.
//!
//! \param startEvents is the ERAD start Mask. It can be an OR of the
//! enumerated ERAD events from DLT_EventSelect.
//! \param endEvents is the ERAD end Mask. It can be an OR of the
//! enumerated ERAD events from DLT_EventSelect.
//!
//! This function configures ERAD events based filtering.
//! When the ERAD start mask is set, it generates a START DLT event, after
//! which entries are recorded in the FIFO.
//! When the ERAD end mask is set, it generates a END DLT event, after which
//! entries are no longer recorded in the FIFO.
//!
//! \return None.
//
//*****************************************************************************
extern void
DLT_configERADFilter(uint64_t startEvents, uint64_t endEvents);


//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // DLT_H
